# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
#
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

n = int(input("Введите трехзначное число: "))
k = 0
sum = 0
for i in range(3):
    if n > 0:
        k = n % 10
        n = n // 10
        sum += k
print(f"сумма цифр равна {sum}")